import { BookI, BookItem } from "../BookItem"

// const books:BookI[] = [
//     {
//         id: 0,
//         img: 'IMG',
//         title: 'Мертвые души',
//         authors: ['Гоголь А.В.', 'Пушкин А.С.'],
//         categories: ['Классика', 'Русское', 'Роман', 'Роман', 'Роман', 'Роман']
//     },
//     {
//         id: 0,
//         img: 'IMG',
//         title: 'Мертвые души',
//         authors: ['Гоголь А.В.', 'Пушкин А.С.'],
//         categories: ['Классика', 'Русское', 'Роман']
//     },        {
//         id: 0,
//         img: 'IMG',
//         title: 'Мертвые души',
//         authors: ['Гоголь А.В.', 'Пушкин А.С.'],
//         categories: ['Классика', 'Русское', 'Роман']
//     },        {
//         id: 0,
//         img: 'IMG',
//         title: 'Мертвые души',
//         authors: ['Гоголь А.В.', 'Пушкин А.С.'],
//         categories: ['Классика', 'Русское', 'Роман']
//     },        {
//         id: 0,
//         img: 'IMG',
//         title: 'Мертвые души',
//         authors: ['Гоголь А.В.', 'Пушкин А.С.'],
//         categories: ['Классика', 'Русское', 'Роман']
//     },        {
//         id: 0,
//         img: 'IMG',
//         title: 'Мертвые души',
//         authors: ['Гоголь А.В.', 'Пушкин А.С.'],
//         categories: ['Классика', 'Русское', 'Роман']
//     },        {
//         id: 0,
//         img: 'IMG',
//         title: 'Мертвые души',
//         authors: ['Гоголь А.В.', 'Пушкин А.С.'],
//         categories: ['Классика', 'Русское', 'Роман']
//     },        {
//         id: 0,
//         img: 'IMG',
//         title: 'Мертвые души',
//         authors: ['Гоголь А.В.', 'Пушкин А.С.'],
//         categories: ['Классика', 'Русское', 'Роман']
//     },        {
//         id: 0,
//         img: 'IMG',
//         title: 'Мертвые души',
//         authors: ['Гоголь А.В.', 'Пушкин А.С.'],
//         categories: ['Классика', 'Русское', 'Роман']
//     },        {
//         id: 0,
//         img: 'IMG',
//         title: 'Мертвые души',
//         authors: ['Гоголь А.В.', 'Пушкин А.С.'],
//         categories: ['Классика', 'Русское', 'Роман']
//     },        {
//         id: 0,
//         img: 'IMG',
//         title: 'Мертвые души',
//         authors: ['Гоголь А.В.', 'Пушкин А.С.'],
//         categories: ['Классика', 'Русское', 'Роман']
//     },        {
//         id: 0,
//         img: 'IMG',
//         title: 'Мертвые души',
//         authors: ['Гоголь А.В.', 'Пушкин А.С.'],
//         categories: ['Классика', 'Русское', 'Роман']
//     },        {
//         id: 0,
//         img: 'IMG',
//         title: 'Мертвые души',
//         authors: ['Гоголь А.В.', 'Пушкин А.С.'],
//         categories: ['Классика', 'Русское', 'Роман']
//     },        {
//         id: 0,
//         img: 'IMG',
//         title: 'Мертвые души',
//         authors: ['Гоголь А.В.', 'Пушкин А.С.'],
//         categories: ['Классика', 'Русское', 'Роман']
//     },        {
//         id: 0,
//         img: 'IMG',
//         title: 'Мертвые души',
//         authors: ['Гоголь А.В.', 'Пушкин А.С.'],
//         categories: ['Классика', 'Русское', 'Роман']
//     },        {
//         id: 0,
//         img: 'IMG',
//         title: 'Мертвые души',
//         authors: ['Гоголь А.В.', 'Пушкин А.С.'],
//         categories: ['Классика', 'Русское', 'Роман']
//     },        {
//         id: 0,
//         img: 'IMG',
//         title: 'Мертвые души',
//         authors: ['Гоголь А.В.', 'Пушкин А.С.'],
//         categories: ['Классика', 'Русское', 'Роман']
//     },        {
//         id: 0,
//         img: 'IMG',
//         title: 'Мертвые души',
//         authors: ['Гоголь А.В.', 'Пушкин А.С.'],
//         categories: ['Классика', 'Русское', 'Роман']
//     },        {
//         id: 0,
//         img: 'IMG',
//         title: 'Мертвые души',
//         authors: ['Гоголь А.В.', 'Пушкин А.С.'],
//         categories: ['Классика', 'Русское', 'Роман']
//     },        {
//         id: 0,
//         img: 'IMG',
//         title: 'Мертвые души',
//         authors: ['Гоголь А.В.', 'Пушкин А.С.'],
//         categories: ['Классика', 'Русское', 'Роман']
//     },        {
//         id: 0,
//         img: 'IMG',
//         title: 'Мертвые души',
//         authors: ['Гоголь А.В.', 'Пушкин А.С.'],
//         categories: ['Классика', 'Русское', 'Роман']
//     },
// ]

type PropsType = {
    bookList: BookI[]
}

export const BookList = ({bookList}: PropsType) => {
    return(
        <div className="flex gap-[30px] z-0 justify-center flex-wrap">
            {bookList.map(book => <BookItem key={book.id} {...book} />)}
            
        </div>
    )
}